{
	"form": {
		"confirm": "Confirm",
		"cancel": "Cancel",
		"loading": "Please wait...",
		"update": "Update",
		"send": "Send",
		"register": "Register by email",
		"log_by_email": "Log in by email",
		"log_by_password": "Log in by password",
		"fields": {
			"email_label": "Email address",
			"email_placeholder": "name@domain.com",
			"email_description_short": "The email address associated with your account.",
			"email_description_long": "This is the email address associated with your account. It is essential for logging in to your account and receiving notifications via email.",
			"username_label": "Username",
			"username_placeholder": "Firstname Lastname",
			"username_description": "This is the username that will be displayed publicly on your profile and in the user search for sharing files. It can be your full name or a simple pseudonym.",
			"password_label": "Password",
			"password_tooltip": "Show or hide the password",
			"password_capslock": "Caps lock is enabled for password entry.",
			"password_placeholder": "@MyPassword123!",
			"password_generation": "Generate a secure password",
			"password_description_short": "The password used to log in to your account.",
			"password_description_long": "This is the password that will be used to log in to your account if you do not wish to use the authentication links sent by email.",
			"language_label_en": "English",
			"language_label_fr": "French",
			"language_label": "Preferred Language",
			"language_description": "This is the language that will be used across all pages of the site. If your language has incomplete translations, we will use the site's default language to complete them.",
			"public_label": "File Publishing",
			"public_description": "By default, files uploaded to the server are private and not accessible to other users. If you enable this option, <b>new files will be automatically published and accessible to all users with the access link</b>.",
			"public_trigger": "Enable automatic publication of uploaded files to the server",
			"extension_label": "File Extension Display",
			"extension_description": "To facilitate file sharing, the access link is generated so that the file extension is not visible. If you enable this option, <b>the extension will be displayed in the access link</b>. This can be useful when using multimedia files (such as videos or music) on older players.",
			"extension_trigger": "Show file extensions in the access link",
			"versions_label": "Old Versions Recording",
			"versions_description": "When you upload a file with the same name as a file already present in your storage space, the existing file is replaced by the new one. If you enable this option, <b>old versions of files will be automatically saved</b> and can be restored at any time.<br></br><i>Note: This option may significantly increase your storage space consumption. If this option was previously enabled, disabling it will delete all old versions of files.</i>",
			"versions_trigger": "Automatically save old versions of files",
			"upload_label": "File Upload",
			"upload_description": "All file formats are accepted. The upload speed depends on your Internet connection and the hardware capabilities of your computer. <b>If a file with the same name already exists, it will be replaced, and a new revision will be created to be restored later if needed.</b>",
			"compression_label": "Image Compression <i>(optional)</i>",
			"compression_trigger": "Enable image compression",
			"compression_description": "If you try to upload images, you can enable this option to have the server automatically compress the images. Image compression can reduce file sizes on your storage quota. <b>Caution, this operation is irreversible and can alter the quality of images. Some images with proprietary extensions are not supported.</b>",
			"encryption_label": "Enhanced Encryption <i>(optional)</i>",
			"encryption_trigger": "Enable enhanced encryption",
			"encryption_description": "Files are encrypted with an encryption key known only to the server. If you enable this option, the file will be encrypted in your browser with a randomly generated key and will not be transmitted to the server. <b>Attention, once the file is uploaded, a decryption key will be displayed, and you must keep it to access the file. If you lose this key, you will no longer be able to access the file.</b>",
			"expiration_label": "Expiration Date <i>(optional)</i>",
			"expiration_trigger": "Select an expiration date",
			"expiration_preset": "Select a preset",
			"expiration_tomorrow": "Tomorrow",
			"expiration_three_days": "In three days",
			"expiration_week": "In one week",
			"expiration_month": "In one month",
			"expiration_description": "Newly uploaded files do not have an expiration date by default. If you want the file to be automatically deleted after a certain duration, enter an expiration date here. <b>Attention, once the file is uploaded, you cannot change its expiration date. The file will be deleted at midnight on the day of expiration.</b>",
			"domain_label": "Domain",
			"domain_account": "Modification of account information",
			"domain_upload": "File uploading to the server",
			"domain_sharing": "File sharing with other users",
			"domain_other": "Other / Unclassified",
			"domain_description": "Indicate the domain affected by the bug.",
			"severity_label": "Severity",
			"severity_low": "Low",
			"severity_medium": "Medium",
			"severity_high": "High",
			"severity_critical": "Critical",
			"severity_description": "Indicate the severity (in your opinion) of the bug.",
			"subject_label": "Subject",
			"subject_placeholder": "There is a problem with...",
			"subject_description": "Write a brief subject to describe the bug.",
			"description_label": "Description",
			"description_placeholder": "Please include all relevant information in your report.",
			"description_description": "Explain in detail the bug you encountered and how to reproduce it.",
			"font_label": "Font",
			"font_description": "Set the font you want to use across all pages of the site.",
			"color_label": "Colors",
			"color_description": "Set the color you want to use across all elements of the site.",
			"theme_label": "Theme",
			"theme_light_title": "Light",
			"theme_light_description": "The light theme suitable for reading in bright environments.",
			"theme_dark_title": "Dark",
			"theme_dark_description": "The dark theme suitable for reading in dark environments.",
			"theme_description": "Set the theme you want to use across all pages of the site.",
			"notifications_label": "Email Notifications",
			"notifications_description": "Send each notification by email in addition to displaying them on the website.",
			"notifications_all_label": "All Notifications",
			"notifications_all_description": "Receive all notifications regarding the management of your user account, your files by you or others, as well as security alerts related to the website and your account.",
			"notifications_necessary_label": "Only Necessary Notifications",
			"notifications_necessary_description": "Receive only important and necessary notifications regarding the management of your user account, files shared with you, and critical security alerts.",
			"notifications_off_label": "No Notifications",
			"notifications_off_description": "Do not receive any notifications except important security alerts regarding your user account and the website.",
			"legal_label": "Legal Documents",
			"legal_description": "View the legal notices of the website",
			"user_files_label": "User Files",
			"user_files_description": "When you upload a file to the server, its data is saved in the file system (or in a cloud storage system depending on the site's configuration), and some information is added to the database to find it more easily.<br></br>If you enable this option, <b>only your files will be permanently deleted from the server without the possibility of recovery via technical support.</b> The deletion will be immediate and will include previous versions as well as sharing data with other users.",
			"user_files_switch": "I want to delete my files as well as all associated data permanently without the possibility of recovery via technical support.",
			"user_account_label": "User Account",
			"user_account_description": "By accessing your user space, you must have created an account by providing an email address and a password. This information is saved in the database and allows you to identify yourself on the site. If you used an external authentication provider (such as Google or GitHub), some data is also saved to identify you automatically (but they do not allow access to your personal information).<br></br>If you enable this option, <b>your entire account will be permanently deleted from the server without the possibility of recovery via technical support.</b> The deletion will be immediate and will include data associated with your account (such as files, previous versions, sharing data with other users, notifications, bug reports, session data, etc.).",
			"user_account_switch": "I want to delete my user account as well as all associated data permanently without the possibility of recovery via technical support."
		},
		"infos": {
			"action_success": "Action successful",
			"action_partial": "Action partially successful",
			"action_required": "Action required",
			"action_failed": "Action failed",
			"data_purged": "All selected data has been successfully purged.",
			"issue_created": "Your bug report has been successfully created.",
			"layout_updated": "Appearance settings have been successfully updated.",
			"notifications_updated": "Notification settings have been successfully updated.",
			"storage_updated": "Storage settings have been successfully updated.",
			"user_updated": "Your user account information has been successfully updated.",
			"file_full_deleted": "All files have been successfully deleted.",
			"file_partial_deleted": "Some files could not be deleted due to an unexpected error.",
			"name_full_updated": "The name of all files has been successfully updated.",
			"name_partial_updated": "The name of some files could not be updated due to an unexpected error.",
			"status_full_updated": "The status of all files has been successfully updated.",
			"status_partial_updated": "The status of some files could not be updated due to an unexpected error.",
			"sharing_updated": "File shares have been successfully updated.",
			"all_sharing_updated": "Shares for all files have been successfully updated.",
			"version_restored": "The selected version has been successfully restored.",
			"upload_success": "All files have been successfully uploaded.",
			"upload_failed": "Some files could not be uploaded due to an unexpected error.",
			"notifications_read": "All notifications have been marked as read.",
			"email_validation": "A confirmation email has been sent to the provided address. Please check your inbox and click on the confirmation link to activate your account."
		},
		"errors": {
			"file_system": "An error occurred while accessing the file system. Please try again later.",
			"too_many": "You have performed this action too many times. Please try again later.",
			"quota_exceeded": "The maximum storage quota has been exceeded. Some files could not be uploaded.",
			"email_used": "This email address is already in use.",
			"auth_failed": "Authentication failed",
			"captcha_failed": "CAPTCHA verification failed",
			"captcha_error": "An error occurred while verifying the CAPTCHA. Please try again later.",
			"server_error": "An error occurred while processing your request by the server.",
			"internal_error": "Internal server error"
		}
	},
	"modals": {
		"make_public": {
			"trigger": "Make Public",
			"title": "Are you sure you want to make {count, plural, =1 {this file} other {these # files}} public?",
			"description": "By making this file public, it will be accessible to everyone, even users outside the website. <b>Sharing restrictions will be reset and deactivated.</b>"
		},
		"make_private": {
			"trigger": "Make Private",
			"title": "Are you sure you want to make {count, plural, =1 {this file} other {these # files}} private?",
			"description": "By making this file private, it will no longer be accessible to users outside the website, nor to unauthorized users via sharing options. <b>The file may still be accessible if it has been cached by a third party.</b>"
		},
		"reset_shares": {
			"trigger": "Remove All Shares",
			"title": "Are you sure you want to remove all shares of {count, plural, =1 {this file} other {these # files}}?",
			"description": "<b>This action is irreversible.</b> It will remove all shares of the file and make the file private."
		},
		"rename_file": {
			"trigger": "Rename Resource",
			"title": "What will be the new name of {count, plural, =1 {this file} other {these # files}}?",
			"description": "<b>This action is irreversible.</b> This will not change the access link, its extension, or any shares currently associated with other users."
		},
		"notifications": {
			"trigger": "New Notifications",
			"title": "Notifications",
			"empty": "You have no new notifications.",
			"description": "You have {count} new notification(s).",
			"read_all": "Mark All as Read",
			"title_0": "Technical Team Intervention",
			"title_1": "Password Change",
			"title_2": "Folder Sharing",
			"title_3": "New Version of a File",
			"title_4": "Deletion of a Shared File",
			"title_5": "Approaching Quota Limit",
			"title_6": "Storage Full",
			"description_0": "Your account has been modified by the technical team. Typically, this follows a request from you or an intervention from us to resolve a technical issue.",
			"description_1": "Your password has been changed. If you did not initiate this change, please contact technical support.",
			"description_2": "Someone has shared a folder with you. You can view the shared folder in your dashboard.",
			"description_3": "Someone has added a new version of a shared file. You can view the new version in your dashboard.",
			"description_4": "Someone has deleted a shared file. It is no longer available in your dashboard.",
			"description_5": "You are nearing the maximum storage quota. Please delete unnecessary files to free up space.",
			"description_6": "Your storage space is full. Please delete unnecessary files to free up space and continue using our service."
		},
		"share-manager": {
			"trigger": "Manage Shares",
			"title": "File Sharing",
			"shared_users": "List of Shared Users",
			"copy": "Copy",
			"copied": "Copied",
			"read": "Read",
			"add": "Add",
			"write": "Write",
			"search": "Search...",
			"delete": "Permanently Delete",
			"empty": "No users have access to this file.",
			"user_list": "Adding New Users to Share",
			"fetch_result": "result(s) found in the database.",
			"fetch_error": "An error occurred while searching. Please try again.",
			"fetch_loading": "Fetching results...",
			"description": "Copy and share the access link with users of your choice."
		},
		"file-upload": {
			"trigger": "Add a File",
			"title": "File Upload",
			"submit": "Upload",
			"quota": "{percent}% of the current quota used ({current} / {max}).",
			"advanced": "Click here to display advanced settings.",
			"description": "This is the file upload form. You can use additional settings to control how files are uploaded."
		},
		"request-key": {
			"title": "Please enter the decryption key.",
			"placeholder": "your-decryption-key",
			"description": "To access this resource, you need to enter the decryption key provided to you during its upload. <b>If lost, you will no longer be able to access it. If this happens, delete it and upload it again. Technical support will not be able to assist you as they do not have the decryption key.</b>"
		},
		"decryption_key": {
			"title": "Decryption Key",
			"description": "You have enabled enhanced encryption for this upload. Your files have been encrypted in your browser with a random encryption key that only you can use to decrypt them. Below is the decryption key that you must keep safe in order to access your files later. <b>If you lose this key, you will no longer be able to access your files.</b>",
			"copy": "Copy to Clipboard"
		},
		"delete_file": {
			"trigger": "Permanently Delete",
			"title": "Are you sure you want to delete {count, plural, =1 {this file} other {these # files}}?",
			"description": "<b>This action is irreversible.</b> It will permanently remove the file from our server and cannot be restored later."
		},
		"file_history": {
			"reach": "Access",
			"trigger": "View Revisions",
			"title": "Available Revisions",
			"details": "Version from {date}",
			"description": "Access and restore a previous version of the file."
		},
		"restore_version": {
			"trigger": "Restore",
			"title": "Are you sure you want to restore this version of the file?",
			"description": "The current version of the file will be saved as a new version and replaced with the selected version."
		}
	},
	"header": {
		"home": "Home",
		"authenticate": "Authenticate",
		"dashboard": "Dashboard",
		"settings": "Settings",
		"logout": "Logout",
		"legal_notices": "Legal Notices",
		"user_account": "User Account",
		"admin_account": "Admin Account",
		"something_else": "Something else?",
		"github_tip": "If the provided settings do not meet your needs, feel free to <u>submit a request</u> on GitHub!"
	},
	"footer": {
		"rights_reserved": "All rights reserved",
		"captcha_protected": "This site is protected by <a>ALTCHA</a>, a free, open-source and privacy-friendly alternative to reCAPTCHA."
	},
	"legal": {
		"description": "Curious about the terms of use of the site and how we process your personal data? It's over here!"
	},
	"dashboard": {
		"hide": "Hide",
		"title": "Open action menu",
		"reset": "Reset",
		"shared": "Shared",
		"public": "Public",
		"private": "Private",
		"filter": "Filter by name...",
		"columns": "Columns",
		"copy_link": "Copy access link",
		"reach_file": "Access file",
		"actions": "File actions",
		"select_line": "Select line",
		"select_all": "Select all",
		"description": "Upload and share your files from your computer.",
		"rows_x": "{selected} out of {total} selected line(s)",
		"pages_x": "Page {page} of {pages}",
		"first_page": "Go to first page",
		"last_page": "Go to last page",
		"previous_page": "Go to previous page",
		"next_page": "Go to next page",
		"no_files": "No files found",
		"ascending": "Ascending order",
		"descending": "Descending order",
		"lines_per_page": "Lines per page",
		"active_columns": "Display columns",
		"name": "Name",
		"owner": "Owner",
		"type": "Type",
		"size": "Size",
		"date": "Date",
		"status": "Status"
	},
	"settings": {
		"header": "General Settings",
		"description": "Manage your account and site settings.",
		"issue": "Found a bug? Something isn't working as expected? You're in the right place to report it!",
		"layout": "Tired of the default theme and colors? Don't like the font? You're in the right place to change all that!",
		"notifications": "Tired of receiving notifications? Want to receive security or reminder emails? You're in the right place!",
		"privacy": "Want to erase your tracks and pretend you've never used the site? This is where it happens!",
		"storage": "Want more control over file behavior when uploaded to the site? You're in the right place!",
		"user": "Want to show who you are? Change your username? Change your password? You're in the right place!"
	},
	"navigation": {
		"user_title": "User",
		"user_description": "Manage your profile and account information.",
		"storage_title": "Storage",
		"storage_description": "Customize file upload mechanism.",
		"layout_title": "Appearance",
		"layout_description": "Customize website appearance.",
		"notifications_title": "Notifications",
		"notifications_description": "Manage notifications received via email or on the website.",
		"issue_title": "Bugs",
		"issue_description": "Report a bug encountered on the website.",
		"privacy_title": "Privacy",
		"privacy_description": "Manage personal data collected by the website.",
		"cookies_title": "Cookies",
		"cookies_description": "Service provided by <u>Cookie Consent</u>"
	},
	"authentication": {
		"register_button": "Register",
		"register_title": "Create an Account",
		"register_description": "To create a new user account, enter your email address. An authentication link will be sent to you to activate your account.",
		"login_button": "Login",
		"login_title": "Login to Your Account",
		"login_description": "To log in to your user account, enter your email address. An authentication link will be sent to you to access your account securely.",
		"continue_with": "Continue with",
		"accept_terms": "By continuing, you accept our <a>legal notices</a>."
	},
	"index": {
		"title": "Discover Our Features",
		"subtitle": "Our features are designed to ensure your privacy and protect your data.",
		"features": {
			"title_1": "End-to-End Secure",
			"title_2": "User-Friendly",
			"title_3": "Privacy Respectful",
			"title_4": "High Performance",
			"title_5": "Effective Tools",
			"title_6": "Shared Storage Space",
			"description_1": "All data is encrypted and stored on secure servers away from prying eyes.",
			"description_2": "The interface is designed to be simple and user-friendly for all users, even your grandparents.",
			"description_3": "Your data is stored on servers based in Europe in accordance with GDPR to ensure complete integrity and confidentiality.",
			"description_4": "Our servers are designed to ensure optimal performance and maximum availability.",
			"description_5": "Our tools are few but effective for recording and sharing your files with other users.",
			"description_6": "We can't promise unlimited storage space, but it provides enough space to store your daily needs."
		}
	},
	"valibot": {
		"wrong_file_name": "One of the uploaded files has an invalid, empty, or too long filename.",
		"wrong_file_type": "One of the uploaded files is not an allowed file type."
	},
	"authjs": {
		"errors": {
			"default": "Unable to authenticate.",
			"Signin": "Try signing in with another account.",
			"OAuthSignin": "Try signing in with another account.",
			"OAuthCallbackError": "Try signing in with another account.",
			"OAuthCreateAccount": "Try signing in with another account.",
			"EmailCreateAccount": "Try signing in with another account.",
			"Callback": "Try signing in with another account.",
			"CallbackRouteError": "Unable to finish the authentication process.",
			"OAuthAccountNotLinked": "To confirm your identity, log in with the same account you initially used.",
			"EmailSignup": "The confirmation email could not be sent to the provided address. Please try again later.",
			"CredentialsSignin": "Authorization failed. Check the information you provided.",
			"SessionRequired": "You must be authenticated to access this resource.",
			"Configuration": "There is a problem with the server configuration. Check if your options are correct.",
			"AccessDenied": "You do not have permission to access this resource.",
			"Verification": "This token is invalid or has expired."
		}
	},
	"nodemailer": {
		"issue": "New report from {email}!",
		"details": "Domain : {area}\nSeverity : {severity}\nSubject : {subject}\nDescription : {description}",
		"subject": "Login to Your Simple File Storage Account",
		"button": "Direct Login",
		"footer": "<strong>This link is valid for 30 minutes.</strong> If you did not initiate this request, you can ignore this email.",
		"long_title": "Login to <strong>{host}</strong> (<em>Simple File Storage</em>)",
		"short_title": "Log in to {host}\n{url}\n\n"
	},
	"consentModal": {
		"title": "Do you want a cookie? 🍪",
		"footer": "<a href=\"/legal\" target=\"blank\">Legal notices</a>",
		"description": "Our website uses tracking cookies to understand how you interact with it. The tracking will be enabled only if you accept explicitly.",
		"acceptAllBtn": "Accept all",
		"acceptNecessaryBtn": "Reject all",
		"showPreferencesBtn": "Manage preferences"
	},
	"preferencesModal": {
		"title": "Cookie preferences",
		"acceptAllBtn": "Accept all",
		"acceptNecessaryBtn": "Reject all",
		"savePreferencesBtn": "Save preferences",
		"closeIconLabel": "Close",
		"sections": [
			{
				"title": "Cookie usage 📢",
				"description": "We use cookies to ensure the basic functionalities of the website and to enhance your online experience."
			},
			{
				"title": "Strictly necessary cookies",
				"description": "These cookies are essential for the proper functioning of the website. Without these cookies, the website would not work properly.",
				"linkedCategory": "necessary",
				"cookieTable": {
					"headers": {
						"name": "Name",
						"domain": "Service",
						"description": "Description",
						"expiration": "Expiration"
					},
					"body": [
						{
							"name": "NEXT_COOKIE",
							"domain": "Cookie Consent",
							"description": "Cookie set by <a href=\"https://cookieconsent.orestbida.com/\" target=\"_blank\">Cookie Consent</a>.",
							"expiration": "Expires after 6 months."
						},
						{
							"name": "NEXT_LOCALE",
							"domain": "Next Intl",
							"description": "Cookie set by <a href=\"https://next-intl-docs.vercel.app/\" target=\"_blank\">Next Intl</a>.",
							"expiration": "Expires at the end of the session."
						},
						{
							"name": "authjs.session-token",
							"domain": "AuthJS",
							"description": "Cookie set by <a href=\"https://authjs.dev/\" target=\"_blank\">AuthJS</a>.",
							"expiration": "Expire after 1 month."
						},
						{
							"name": "authjs.csrf-token",
							"domain": "AuthJS",
							"description": "Cookie set by <a href=\"https://authjs.dev/\" target=\"_blank\">AuthJS</a>.",
							"expiration": "Expire after 1 month."
						},
						{
							"name": "authjs.callback-url",
							"domain": "AuthJS",
							"description": "Cookie set by <a href=\"https://authjs.dev/\" target=\"_blank\">AuthJS</a>.",
							"expiration": "Expire after 1 month."
						}
					]
				}
			},
			{
				"title": "Performance and Analytics cookies",
				"description": "These cookies allow the website to remember the choices you have made in the past.",
				"linkedCategory": "analytics",
				"cookieTable": {
					"headers": {
						"name": "Name",
						"domain": "Service",
						"description": "Description",
						"expiration": "Expiration"
					},
					"body": [
						{
							"name": "_ga",
							"domain": "Google Analytics",
							"description": "Cookie set by <a href=\"https://support.google.com/analytics/answer/10089681\" target=\"_blank\">Google Analytics</a>.",
							"expiration": "Expires after 12 days"
						}
					]
				}
			},
			{
				"title": "More information",
				"description": "For any queries in relation to our policy on cookies and your choices, please contact us using our website support."
			}
		]
	}
}