{
	"form": {
		"confirm": "Confirmer",
		"cancel": "Annuler",
		"loading": "Veuillez patienter...",
		"update": "Mettre à jour",
		"register": "Inscription par courriel",
		"log_by_email": "Se connecter par courriel",
		"log_by_password": "Se connecter par mot de passe",
		"fields": {
			"email_label": "Adresse électronique",
			"email_placeholder": "prenom.nom@mon-domaine.fr",
			"email_description_short": "L'adresse électronique associée à votre compte.",
			"email_description_long": "Ceci est l'adresse électronique associée à votre compte. Elle est indispensable pour vous connecter à votre compte et recevoir les notifications via courriel.",
			"username_label": "Nom d'utilisateur",
			"username_placeholder": "Prénom Nom",
			"username_description": "Ceci est le nom d'utilisateur qui sera affiché publiquement sur votre profil et dans la recherche d'utilisateurs pour partager des fichiers. Cela peut être votre nom complet ou un simple pseudonyme.",
			"password_label": "Mot de passe",
			"password_tooltip": "Voir ou masquer le mot de passe",
			"password_capslock": "Les majuscules ont été activées pour la saisie du mot de passe.",
			"password_placeholder": "@MonMotDePasse123!",
			"password_generation": "Générer un mot de passe sécurisé",
			"password_description_short": "Le mot de passe utilisé pour vous connecter à votre compte.",
			"password_description_long": "Ceci est le mot de passe qui sera utilisé pour vous connecter à votre compte si vous ne souhaitez pas utiliser les liens d'authentification envoyés par courriel.",
			"language_label_en": "Anglais",
			"language_label_fr": "Français",
			"language_label": "Langue préférée",
			"language_description": "Ceci est la langue qui sera utilisée sur l'ensemble des pages du site. Si votre langue comporte des traductions incomplètes, nous utiliserons la langue par défaut du site pour les compléter.",
			"avatar_label": "Avatar",
			"avatar_description": "Vous pouvez mettre à jour l'avatar utilisé pour votre compte utilisateur. <b>Les avatars ne doivent pas dépasser {size} et doivent être au format PNG, JPEG ou WEBP</b>.",
			"otp_label": "Authentification à deux facteurs",
			"otp_description_short": "L'authentification à deux facteurs peut être nécessaire en complément de votre mot de passe pour vous connecter à votre compte.",
			"otp_description_long": "Vous pouvez désactiver l'authentification à deux facteurs en saisissant un code provenant de votre application. <b>Si vous avez perdu votre téléphone, veuillez utiliser le code de secours fourni lors de l'activation</b>.",
			"public_label": "Publication des fichiers",
			"public_description": "Par défaut, les fichiers téléversés sur le serveur sont privés et ne sont pas accessibles aux autres utilisateurs. Si vous activez cette option, <b>les nouveaux fichiers seront automatiquement publiés et accessibles à tous les utilisateurs disposant du lien d'accès</b>.",
			"public_trigger": "Activer la publication automatique des fichiers téléversés sur le serveur",
			"extension_label": "Affichage des extensions",
			"extension_description": "Pour faciliter le partage des fichiers, le lien d'accès est généré de manière à ce que l'extension du fichier ne soit pas visible. Si vous activez cette option, <b>l'extension sera affichée dans le lien d'accès</b>. Cela peut être utile lorsque vous utilisez des fichiers multimédias (comme des vidéos ou des musiques) sur des lecteurs anciens.",
			"extension_trigger": "Afficher les extensions des fichiers dans le lien d'accès",
			"versions_label": "Enregistrement des anciennes versions",
			"versions_description": "Lorsque vous téléversez un fichier portant le même nom qu'un fichier déjà présent dans votre espace de stockage, le fichier existant est remplacé par le nouveau. Si vous activez cette option, <b>les anciennes versions des fichiers seront automatiquement enregistrées</b> et pourront être restaurées à tout moment.<br></br><i>Note : cette option peut augmenter significativement la consommation de votre espace de stockage. Si cette option était précédemment activée, la désactivation aura pour effet de supprimer toutes les anciennes versions des fichiers.</i>",
			"versions_trigger": "Enregistrer automatiquement les anciennes versions des fichiers",
			"remembered_label": "Se souvenir de moi",
			"remembered_description": "Pour rester connecté à votre compte lorsque vous revenez sur le site.",
			"upload_label": "Téléversement de fichiers",
			"upload_description": "Tous les formats de fichiers sont acceptés. La vitesse de téléversement dépend de votre connexion Internet et des capacités matérielles de votre ordinateur. <b>Si un fichier du même nom existe déjà, il sera remplacé et une nouvelle révision sera créée pour être restaurée ultérieurement si besoin.</b>",
			"compression_label": "Compression des images <i>(optionnel)</i>",
			"compression_trigger": "Activer la compression des images",
			"compression_description": "Si vous essayez de téléverser des images, vous pouvez activer cette option pour faire compresser les images automatiquement par le serveur. La compression des images peut réduire la taille des fichiers sur votre quota de stockage. <b>Attention, cette opération est irréversible et peut altérer la qualité des images. Certaines images ayant des extensions propriétaires ne sont pas prises en charge.</b>",
			"encryption_label": "Chiffrement renforcé <i>(optionnel)</i>",
			"encryption_trigger": "Activer le chiffrement renforcé",
			"encryption_description": "Les fichiers sont chiffrés avec une clé de chiffrement connue uniquement par le serveur. Si vous activez cette option, le fichier sera chiffré dans votre navigateur avec une clé générée aléatoirement et ne sera pas transmise au serveur. <b>Attention, une fois le fichier téléversé, une clé de déchiffrement sera affichée et vous devrez la conserver afin de pouvoir accéder au fichier. Si vous perdez cette clé, vous ne pourrez plus accéder au fichier.</b>",
			"expiration_label": "Date d'expiration <i>(optionnel)</i>",
			"expiration_trigger": "Sélectionner une date d'expiration",
			"expiration_preset": "Sélectionner une présélection",
			"expiration_tomorrow": "Demain",
			"expiration_three_days": "Dans trois jours",
			"expiration_week": "Dans une semaine",
			"expiration_month": "Dans un mois",
			"expiration_description": "Les nouveaux fichiers téléversés n'ont pas de date d'expiration par défaut. Si vous souhaitez que le fichier soit supprimé automatiquement après une certaine durée, entrez une date d'expiration ici. <b>Attention, une fois le fichier téléversé, vous ne pourrez plus changer sa date d'expiration. La suppression du fichier sera effectuée à minuit le jour de l'expiration.</b>",
			"domain_label": "Domaine",
			"domain_account": "Modification des informations du compte",
			"domain_upload": "Téléversement des fichiers vers le serveur",
			"domain_sharing": "Partage des fichiers avec d'autres utilisateurs",
			"domain_other": "Autres / Non classé",
			"domain_description": "Indiquez le domaine concerné par le bogue.",
			"severity_label": "Sévérité",
			"severity_low": "Faible",
			"severity_medium": "Moyenne",
			"severity_high": "Élevée",
			"severity_critical": "Critique",
			"severity_description": "Indiquez la sévérité (selon vous) du bogue.",
			"subject_label": "Sujet",
			"subject_placeholder": "Il y a un problème avec...",
			"subject_description": "Écrivez un sujet court pour décrire le bogue.",
			"description_label": "Description",
			"description_placeholder": "Veillez inclure toutes les informations pertinentes à votre signalement.",
			"description_description": "Expliquez en détail le bogue que vous avez rencontré et comment le reproduire.",
			"font_label": "Police de caractères",
			"font_description": "Définissez la police que vous souhaitez utiliser sur l'ensemble des pages du site.",
			"color_label": "Couleurs",
			"color_description": "Définissez la couleur que vous souhaitez utiliser sur l'ensemble des éléments du site.",
			"theme_label": "Thème",
			"theme_light_title": "Clair",
			"theme_light_description": "Le thème clair adapté à la lecture en milieu lumineux.",
			"theme_dark_title": "Sombre",
			"theme_dark_description": "Le thème sombre adapté à la lecture en milieu sombre.",
			"theme_description": "Définissez le thème que vous souhaitez utiliser sur l'ensemble des pages du site.",
			"notifications_label": "Notifications par courriel",
			"notifications_description": "Envoyer chaque notification par courriel en plus de les afficher sur le site Internet.",
			"notifications_all_label": "Toutes les notifications",
			"notifications_all_description": "Recevez l'intégralité des notifications concernant la gestion de votre compte utilisateur, de vos fichiers par vous ou des tiers, ainsi que les alertes de sécurité relatives au site Internet et à votre compte.",
			"notifications_necessary_label": "Seulement les notifications nécessaires",
			"notifications_necessary_description": "Recevez seulement les notifications importantes et nécessaires concernant la gestion de votre compte utilisateur, les fichiers partagés avec vous et les alertes de sécurité critiques.",
			"notifications_off_label": "Aucune notification",
			"notifications_off_description": "Ne recevez aucune notification sauf les alertes de sécurité importantes concernant votre compte utilisateur et le site Internet.",
			"legal_label": "Documents légaux",
			"legal_description_1": "Consulter les conditions d'utilisation (français seulement).",
			"legal_description_2": "Consulter la politique de confidentialité (français seulement).",
			"user_files_label": "Fichiers utilisateur",
			"user_files_description": "Lorsque vous téléversez un fichier sur le serveur, ses données sont enregistrées dans le système de fichiers (ou dans un système de stockage en nuage selon la configuration du site) et certaines informations sont ajoutées à la base de données afin de le retrouver plus facilement.<br></br>Si vous activez cette option, <b>seuls vos fichiers seront supprimés définitivement du serveur sans possibilité de récupération via l'assistance technique.</b> La suppression sera immédiate et inclura les versions antérieures ainsi que les données de partage à d'autres utilisateurs.",
			"user_files_switch": "Je veux supprimer mes fichiers ainsi que toutes les données associées définitivement sans possibilité de récupération via l'assistance technique.",
			"user_account_label": "Compte utilisateur",
			"user_account_description": "En accédant à votre espace utilisateur, vous avez dû créer un compte en fournissant une adresse email et un mot de passe. Ces informations sont enregistrées dans la base de données et permettent de vous identifier sur le site. Si vous avez utilisé un fournisseur d'authentification externe (comme Google ou GitHub), certaines données sont également enregistrées afin de vous identifier automatiquement (mais ils ne permettent pas d'accéder à vos informations personnelles).<br></br>Si vous activez cette option, <b>l'ensemble de votre compte sera supprimé définitivement du serveur sans possibilité de récupération via l'assistance technique.</b> La suppression sera immédiate et inclura les données associées à votre compte (comme les fichiers, les versions antérieures, les données de partage à d'autres utilisateurs, les notifications, les signalements de bogues, les données de session, l'avatar, etc.).",
			"user_account_switch": "Je veux supprimer mon compte utilisateur ainsi que toutes les données associées définitivement sans possibilité de récupération via l'assistance technique."
		},
		"infos": {
			"action_success": "Action réussie",
			"action_partial": "Action partiellement réussie",
			"action_required": "Action requise",
			"action_failed": "Action échouée",
			"otp_enabled": "L'authentification à deux facteurs a été activée avec succès.",
			"data_purged": "Toutes les données sélectionnées ont été purgées avec succès.",
			"issue_created": "Votre signalement de bogue a été créé avec succès.",
			"layout_updated": "Les paramètres d'apparence ont été mis à jour avec succès.",
			"notifications_updated": "Les paramètres de notification ont été mis à jour avec succès.",
			"storage_updated": "Les paramètres de stockage ont été mis à jour avec succès.",
			"user_updated": "Les informations de votre compte utilisateur ont été mises à jour avec succès.",
			"file_full_deleted": "Tous les fichiers ont été supprimés avec succès.",
			"file_partial_deleted": "Certains fichiers n'ont pas pu être supprimés à cause d'une erreur inattendue.",
			"name_full_updated": "Le nom de tous les fichiers a été mis à jour avec succès.",
			"name_partial_updated": "Le nom de certains fichiers n'a pas pu être mis à jour à cause d'une erreur inattendue.",
			"status_full_updated": "Le statut de tous les fichiers a été mis à jour avec succès.",
			"status_partial_updated": "Le statut de certains fichiers n'a pas pu être mis à jour à cause d'une erreur inattendue.",
			"sharing_updated": "Les partages du fichier ont été mis à jour avec succès.",
			"all_sharing_updated": "Les partages de tous les fichiers ont été mis à jour avec succès.",
			"version_restored": "La version sélectionnée a été restaurée avec succès.",
			"upload_success": "Tous les fichiers ont été téléversés avec succès.",
			"upload_failed": "Certains fichiers n'ont pas pu être téléversés à cause d'une erreur inattendue.",
			"notifications_read": "Toutes les notifications ont été marquées comme lues.",
			"email_validation": "Un courriel de confirmation a été envoyé à l'adresse que vous avez fournie. Veuillez vérifier votre boîte de réception et cliquer sur le lien de confirmation pour activer votre compte."
		},
		"errors": {
			"file_system": "Une erreur s'est produite lors de l'accès au système de fichiers. Veuillez réessayer plus tard.",
			"too_many": "Vous avez réalisé cette action trop de fois. Veuillez réessayer plus tard.",
			"quota_exceeded": "Le quota de stockage maximal a été dépassé. Certains fichiers n'ont pas pu être téléversés.",
			"email_used": "Cette adresse électronique est déjà utilisée.",
			"auth_failed": "Échec de l'authentification",
			"server_error": "Une erreur s'est produite lors du traitement de votre demande par le serveur.",
			"invalid_otp": "Le code de vérification que vous avez fourni est incorrect.",
			"otp_required": "Un code de vérification est requis pour continuer.",
			"internal_error": "Erreur interne du serveur"
		}
	},
	"modals": {
		"otp_backup": {
			"title": "Code de secours",
			"description": "Votre compte est désormais protégé par l'authentification à deux facteurs. Ci-dessous se trouve un code de secours que vous pouvez utiliser afin de désactiver l'authentification à deux facteurs si vous perdez votre téléphone. <b>Si vous perdez ce code, vous devrez contacter le support technique mais votre demande pourra être refusée en cas de négligence constatée.</b>",
			"close": "Copier dans le presse-papiers"
		},
		"otp_validation": {
			"trigger": "Activation de l'authentification à deux facteurs",
			"title": "Authentification à deux facteurs",
			"description": "Afin de sécuriser davantage votre compte, vous pouvez activer l'authentification à deux facteurs. <br></br>1. Tout d'abord, vous devez scanner le code QR ci-dessus avec une application compatible comme <a1>Google Authenticator</a1> ou <a2>Authy</a2>. <br></br>2. Une fois activée, veuillez saisir ci-dessous le code de sécurité généré par votre application pour valider la double authentification. <br></br>3. Lorsque la double authentification est validée, vous serez invité à sauvegarder un code de secours pour désactiver la double authentification si vous perdez votre téléphone.",
			"close": "Activer l'authentification à deux facteurs"
		},
		"reset_password": {
			"trigger": "Vous avez oublié votre mot de passe ?",
			"title": "Oubli du mot de passe",
			"description": "Si vous avez oublié votre mot de passe, essayez de vous connecter à votre compte avec un lien d'authentification à usage unique envoyé à votre adresse électronique. Une fois connecté, vous pourrez saisir un nouveau mot de passe pour votre compte. <b>En cas de perte de l'accès à votre adresse électronique, vous devrez recréer un nouveau compte car le support technique ne sera pas légalement autorisé à vous aider à récupérer l'accès à votre compte.</b>",
			"close": "J'ai bien compris"
		},
		"make_public": {
			"trigger": "Rendre public",
			"title": "Êtes-vous sûr de vouloir rendre public {count, plural, =1 {ce fichier} other {ces # fichiers}} ?",
			"description": "En rendant ce fichier public, il sera accessible à tout le monde, même aux utilisateurs en dehors du site Internet. <b>Les restrictions de partage seront réinitialisées et désactivées.</b>"
		},
		"make_private": {
			"trigger": "Rendre privé",
			"title": "Êtes-vous sûr de vouloir rendre privé {count, plural, =1 {ce fichier} other {ces # fichiers}} ?",
			"description": "En rendant ce fichier privé, il ne sera plus accessible aux utilisateurs en dehors du site Internet, ni aux utilisateurs non autorisés via les options de partage. <b>Le fichier peut encore être accessible si celui-ci a été mis en cache par un tiers.</b>"
		},
		"reset_shares": {
			"trigger": "Supprimer tous les partages",
			"title": "Êtes-vous sûr de vouloir supprimer tous les partages de {count, plural, =1 {ce fichier} other {ces # fichiers}} ?",
			"description": "<b>Cette action est irréversible.</b> Elle supprimera tous les partages du fichier et rendra le fichier privé."
		},
		"rename_file": {
			"trigger": "Renommer la ressource",
			"title": "Quel sera le nouveau nom de {count, plural, =1 {ce fichier} other {ces # fichiers}} ?",
			"description": "<b>Cette action est irréversible.</b> Cela Cela ne modifiera pas le lien d'accès, ni son extension et ni les partages actuellement associés avec d'autres utilisateurs."
		},
		"notifications": {
			"trigger": "Nouvelles notifications",
			"title": "Notifications",
			"empty": "Vous n'avez aucune nouvelle notification.",
			"description": "Vous avez {count} nouvelle(s) notification(s).",
			"read_all": "Tout marquer comme lu",
			"title_0": "Intervention de l'équipe technique",
			"title_1": "Changement de mot de passe",
			"title_2": "Partage de dossier",
			"title_3": "Nouvelle version d'un fichier",
			"title_4": "Suppression d'un fichier partagé",
			"title_5": "Dépassement prochain du quota",
			"title_6": "Stockage plein",
			"description_0": "Votre compte a été modifié par l'équipe technique. En général, cela fait suite à une demande de votre part ou à une intervention de notre part pour résoudre un problème technique.",
			"description_1": "Votre mot de passe a été modifié. Si vous n'êtes pas à l'origine de cette modification, veuillez contacter le support technique.",
			"description_2": "Quelqu'un a partagé un dossier avec vous. Vous pouvez consulter le dossier partagé dans votre tableau de bord.",
			"description_3": "Quelqu'un a ajouté une nouvelle version d'un fichier partagé. Vous pouvez consulter la nouvelle version dans votre tableau de bord.",
			"description_4": "Quelqu'un a supprimé un fichier partagé. Il n'est plus disponible dans votre tableau de bord.",
			"description_5": "Vous êtes proche du quota de stockage maximal. Veuillez supprimer des fichiers inutiles pour libérer de l'espace.",
			"description_6": "Votre espace de stockage est plein. Veuillez supprimer des fichiers inutiles pour libérer de l'espace et continuer à utiliser notre service."
		},
		"share-manager": {
			"trigger": "Gérer les partages",
			"title": "Partage du fichier",
			"shared_users": "Liste des utilisateurs en partage",
			"copy": "Copier",
			"copied": "Copié",
			"read": "Lecture",
			"add": "Ajouter",
			"write": "Écriture",
			"search": "Rechercher...",
			"delete": "Supprimer définitivement",
			"empty": "Aucun utilisateur n'a accès à ce fichier.",
			"user_list": "Ajouts de nouveaux utilisateurs en partage",
			"fetch_result": "résultat(s) trouvé(s) dans la base de données.",
			"fetch_error": "Une erreur est survenue lors de la recherche. Veuillez réessayer.",
			"fetch_loading": "Chargement des résultats...",
			"description": "Copier et partager le lien d'accès aux utilisateurs de votre choix."
		},
		"file-upload": {
			"trigger": "Ajouter un fichier",
			"title": "Téléversement de fichiers",
			"submit": "Téléverser",
			"quota": "{percent}% du quota actuellement utilisé ({current} / {max}).",
			"advanced": "Cliquez ici pour afficher les paramètres avancés.",
			"description": "Ceci est le formulaire de téléversement de fichiers. Vous pouvez utiliser des paramètres supplémentaires pour contrôler la façon dont les fichiers sont téléversés."
		},
		"request-key": {
			"title": "Veuillez saisir la clé de déchiffrement.",
			"placeholder": "votre-clé-de-déchiffrement",
			"description": "Pour accéder à cette ressource, vous devez saisir la clé de déchiffrement qui vous a été fournie lors de son téléversement. <b>En cas de perte, vous ne pourrez plus y accéder. Si c'est le cas, supprimez-la et téléversez-la à nouveau. Le support technique ne pourra pas vous aider car il ne possède pas la clé de déchiffrement.</b>"
		},
		"decryption_key": {
			"title": "Clé de déchiffrement",
			"description": "Vous avez activé le chiffrement renforcé pour ce téléversement. Vos fichiers ont été chiffrés dans votre navigateur avec une clé de chiffrement aléatoire que vous seul pouvez utiliser pour les déchiffrer. Vous trouverez ci-dessous la clé de déchiffrement que vous devez conserver précieusement pour pouvoir accéder à vos fichiers ultérieurement. <b>Si vous perdez cette clé, vous ne pourrez plus accéder à vos fichiers.</b>",
			"copy": "Copier dans le presse-papiers"
		},
		"delete_file": {
			"trigger": "Supprimer définitivement",
			"title": "Êtes-vous sûr de vouloir supprimer {count, plural, =1 {ce fichier} other {ces # fichiers}} ?",
			"description": "<b>Cette action est irréversible.</b> Elle supprimera définitivement le fichier de notre serveur et ne pourra pas être restaurée ultérieurement."
		},
		"file_history": {
			"reach": "Accéder",
			"trigger": "Voir les révisions",
			"title": "Révisions disponibles",
			"details": "Version du {date}",
			"description": "Accéder et restaurer une version antérieure du fichier."
		},
		"restore_version": {
			"trigger": "Restaurer",
			"title": "Êtes-vous sûr de vouloir restaurer cette version du fichier ?",
			"description": "La version actuelle du fichier sera sauvegardée sous forme d'une nouvelle version et remplacée par la version sélectionnée."
		}
	},
	"header": {
		"home": "Accueil",
		"authenticate": "Authentification",
		"dashboard": "Tableau de bord",
		"settings": "Paramètres",
		"logout": "Déconnexion",
		"terms_of_service": "Conditions d'utilisation",
		"privacy_policy": "Politique de confidentialité",
		"user_account": "Compte utilisateur",
		"admin_account": "Compte administrateur",
		"something_else": "Autre chose ?",
		"github_tip": "Si les paramètres proposés ne correspondent pas à vos besoins, n'hésitez pas à <u>faire une demande</u> sur GitHub !"
	},
	"footer": {
		"rights_reserved": "Tous droits réservés",
		"recaptcha_protected": "Ce site est protégé par reCAPTCHA sur lequel s'appliquent les <a1>politiques de confidentialité</a1> et les <a2>conditions d'utilisation</a2> de Google."
	},
	"legal": {
		"terms_title": "Conditions d'utilisation",
		"terms_description": "Curieux de connaître les conditions d'utilisation du site ? C'est par ici !",
		"privacy_title": "Politique de confidentialité",
		"privacy_description": "Vous voulez en savoir plus sur la manière dont nous traitons vos données personnelles ? C'est bien par là !"
	},
	"dashboard": {
		"hide": "Cacher",
		"title": "Ouvrir le menu des actions",
		"reset": "Réinitialiser",
		"filter": "Filtrer par nom...",
		"columns": "Colonnes",
		"copy_link": "Copier le lien d'accès",
		"reach_file": "Accéder au fichier",
		"actions": "Actions sur le fichier",
		"select_line": "Sélectionner la ligne",
		"select_all": "Tout sélectionner",
		"description": "Téléverser et partager vos fichiers à partir de votre ordinateur.",
		"rows_x": "{selected} sur {total} ligne(s) sélectionnée(s)",
		"pages_x": "Page {page} sur {pages}",
		"first_page": "Aller à la première page",
		"last_page": "Aller à la dernière page",
		"previous_page": "Aller à la page précédente",
		"next_page": "Aller à la page suivante",
		"no_files": "Aucun fichier trouvé",
		"ascending": "Ordre croissant",
		"descending": "Ordre décroissant",
		"lines_per_page": "Lignes par page",
		"active_columns": "Affichage des colonnes",
		"name": "Nom",
		"owner": "Propriétaire",
		"type": "Type",
		"size": "Taille",
		"date": "Date",
		"status": "Statut"
	},
	"settings": {
		"header": "Paramètres généraux",
		"description": "Gérer les paramètres de votre compte et du site.",
		"issue": "Vous avez trouvé un bogue ? Quelque chose ne fonctionne pas comme prévu ? Vous êtes au bon endroit pour nous le signaler !",
		"layout": "Lassez du thème et des couleurs par défaut ? La police d'écriture ne vous plaît pas ? Vous êtes au bon endroit pour changer tout ça !",
		"notifications": "Marre de recevoir des notifications ? Envie de recevoir des courriels de sécurité ou de rappel ? Vous êtes au bon endroit !",
		"privacy": "Vous voulez effacer vos traces et faire comme si vous n'aviez jamais utilisé le site ? C'est ici que ça se passe !",
		"storage": "Vous voulez contrôler davantage le comportement des fichiers lorsqu'ils sont téléversés sur le site ? Vous êtes au bon endroit !",
		"user": "Vous voulez montrez qui vous êtes ? Modifier votre nom d'utilisateur ? Changer votre mot de passe ? Vous êtes au bon endroit !"
	},
	"navigation": {
		"user_title": "Utilisateur",
		"user_description": "Gestion des informations de votre profil et de votre compte.",
		"storage_title": "Stockage",
		"storage_description": "Personnalisation du mécanisme de téléversement des fichiers.",
		"layout_title": "Apparence",
		"layout_description": "Personnalisation de l'apparence du site Internet.",
		"notifications_title": "Notifications",
		"notifications_description": "Gestion des notifications reçues par courriel ou sur le site Internet.",
		"issue_title": "Bogues",
		"issue_description": "Signalement d'un bogue rencontré sur le site Internet.",
		"privacy_title": "Confidentialité",
		"privacy_description": "Gestion des données personnelles collectées par le site Internet.",
		"cookies_title": "Cookies",
		"cookies_description": "Service fourni par <u>Cookie Consent</u>"
	},
	"authentication": {
		"register_button": "Inscription",
		"register_title": "Création d'un compte",
		"register_description": "Saisissez votre adresse électronique pour créer un nouveau compte utilisateur. Vous recevrez un lien d'activation pour valider votre compte et saisir un mot de passe.",
		"login_button": "Connexion",
		"login_title": "Connexion à votre compte",
		"login_description": "Saisissez votre adresse électronique pour vous connecter à l'aide d'un lien d'authentification. Si vous avez associé un mot de passe à votre compte, vous pouvez également le saisir pour vous connecter directement.",
		"continue_with": "Continuer avec",
		"accept_terms": "En continuant, vous acceptez nos <a1>conditions d'utilisation</a1> et notre <a2>politique de confidentialité</a2>."
	},
	"index": {
		"title": "Découvrez nos fonctionnalités",
		"subtitle": "Nos fonctionnalités sont conçues pour garantir votre confidentialité et protéger vos données.",
		"features": {
			"title_1": "Sécurisé de bout en bout",
			"title_2": "Simple d'utilisation",
			"title_3": "Respect de la vie privée",
			"title_4": "Haute performance",
			"title_5": "Outils efficaces",
			"title_6": "Espace de stockage partagé",
			"description_1": "Toutes les données sont chiffrées et stockées sur des serveurs sécurisés et à l'abri des regards indiscrets.",
			"description_2": "L'interface est conçue pour être simple et ergonomique pour tous les utilisateurs, même pour vos grands-parents.",
			"description_3": "Vos données sont stockées sur des serveurs basés en Europe conformément au RGPD pour garantir une intégrité et une confidentialité totale.",
			"description_4": "Nos serveurs sont prévus pour garantir une performance optimale et une disponibilité maximale.",
			"description_5": "Nos outils sont peu nombreux mais efficaces pour l'enregistrement et le partage de vos fichiers avec d'autres utilisateurs.",
			"description_6": "Nous ne pouvons pas vous garantir un espace de stockage illimité, mais il permet de stocker suffisamment de fichiers pour vos besoins quotidiens."
		}
	},
	"zod": {
		"invalid_type": "Le type de valeur fournie n'est pas valide.",
		"invalid_type_received_undefined": "La type de valeur est obligatoire.",
		"invalid_literal": "La valeur fournie n'est pas une valeur valide.",
		"invalid_union": "Aucune des valeurs fournies n'est valide.",
		"invalid_union_discriminator": "La valeur du discriminateur est invalide.",
		"invalid_intersection_types": "Les résultats d'intersection n'ont pas pu être fusionnés",
		"unrecognized_keys": "Des clés non reconnues ont été fournies dans l'objet.",
		"invalid_enum_value": "La valeur fournie n'est pas une valeur valide de l'énumération.",
		"invalid_arguments": "Les arguments fournis ne sont pas valides.",
		"invalid_return_type": "Le type de retour de la fonction n'est pas valide.",
		"invalid_date": "La date fournie n'est pas valide.",
		"too_small": "La valeur fournie est trop petite.",
		"too_big": "La valeur fournie est trop grande.",
		"custom": "La valeur fournie n'est pas valide.",
		"invalid_string": "La valeur fournie n'est pas une chaîne de caractères valide.",
		"not_multiple_of": "La valeur fournie n'est pas un multiple valide.",
		"not_finite": "La valeur fournie doit être finie.",
		"wrong_file_object": "L'un des fichiers téléversés n'est pas un fichier valide.",
		"wrong_file_size": "L'un des fichiers téléversés dépasse la taille maximale autorisée.",
		"wrong_file_name": "L'un des fichiers téléversés a un nom de fichier invalide, vide ou trop long.",
		"wrong_file_type": "L'un des fichiers téléversés n'est pas un type de fichier autorisé."
	},
	"authjs": {
		"errors": {
			"default": "Impossible d'effectuer l'authentification.",
			"Signin": "Essayez de vous connecter avec un autre compte.",
			"OAuthSignin": "Essayez de vous connecter avec un autre compte.",
			"OAuthCallbackError": "Essayez de vous connecter avec un autre compte.",
			"OAuthCreateAccount": "Essayez de vous connecter avec un autre compte.",
			"EmailCreateAccount": "Essayez de vous connecter avec un autre compte.",
			"Callback": "Essayez de vous connecter avec un autre compte.",
			"OAuthAccountNotLinked": "Pour confirmer votre identité, connectez-vous avec le même compte que celui que vous avez utilisé initialement.",
			"EmailSignup": "Le courriel de confirmation n'a pas pu être envoyé à l'adresse que vous avez fournie. Veuillez réessayer plus tard.",
			"CredentialsSignin": "Vérifiez les informations que vous avez fournies.",
			"SessionRequired": "Vous devez être authentifié pour accéder à cette ressource."
		}
	},
	"nodemailer": {
		"subject": "Connexion à votre compte Simple File Storage",
		"button": "Connexion directe",
		"footer": "<strong>Ce lien est valable 30 minutes.</strong> Si vous n'êtes pas à l'origine de cette demande, vous pouvez ignorer ce courriel.",
		"long_title": "Connexion à <strong>{host}</strong> (<em>Simple File Storage</em>)",
		"short_title": "Connectez-vous à {host}\n{url}\n\n"
	},
	"consentModal": {
		"title": "Voulez-vous un cookie ? 🍪",
		"footer": "<a href=\"legal/privacy\" target=\"_blank\">Politique de confidentialité</a><a href=\"legal/terms\" target=\"_blank\">Conditions d'utilisation</a>",
		"description": "Notre site Internet utilise des cookies de suivi pour comprendre comment vous interagissez avec lui. Le suivi ne sera activé que si vous l'acceptez explicitement.",
		"acceptAllBtn": "Tout accepter",
		"acceptNecessaryBtn": "Tout refuser",
		"showPreferencesBtn": "Gérer les préférences"
	},
	"preferencesModal": {
		"title": "Préférences en matière de cookies",
		"acceptAllBtn": "Tout accepter",
		"acceptNecessaryBtn": "Tout refuser",
		"savePreferencesBtn": "Sauvegarder les préférences",
		"closeIconLabel": "Fermer",
		"sections": [
			{
				"title": "Utilisation des cookies 📢",
				"description": "Nous utilisons des cookies pour assurer les fonctionnalités de base du site Internet et pour améliorer votre expérience en ligne."
			},
			{
				"title": "Cookies strictement nécessaires",
				"description": "Ces cookies sont essentiels au bon fonctionnement du site Internet. Sans ces cookies, le site ne fonctionnerait pas correctement.",
				"linkedCategory": "necessary",
				"cookieTable": {
					"headers": {
						"name": "Nom",
						"domain": "Service",
						"description": "Description",
						"expiration": "Expiration"
					},
					"body": [
						{
							"name": "NEXT_COOKIE",
							"domain": "Cookie Consent",
							"description": "Cookie mis en place par <a href=\"https://cookieconsent.orestbida.com/\" target=\"_blank\">Cookie Consent</a>.",
							"expiration": "Expire après 6 mois."
						},
						{
							"name": "NEXT_LOCALE",
							"domain": "Next Intl",
							"description": "Cookie mis en place par <a href=\"https://next-intl-docs.vercel.app/\" target=\"_blank\">Next Intl</a>.",
							"expiration": "Expire à la fin de la session."
						},
						{
							"name": "authjs.session-token",
							"domain": "AuthJS",
							"description": "Cookie mis en place par <a href=\"https://authjs.dev/\" target=\"_blank\">AuthJS</a>.",
							"expiration": "Expire après 1 mois."
						},
						{
							"name": "authjs.csrf-token",
							"domain": "AuthJS",
							"description": "Cookie mis en place par <a href=\"https://authjs.dev/\" target=\"_blank\">AuthJS</a>.",
							"expiration": "Expire après 1 mois."
						},
						{
							"name": "authjs.callback-url",
							"domain": "AuthJS",
							"description": "Cookie mis en place par <a href=\"https://authjs.dev/\" target=\"_blank\">AuthJS</a>.",
							"expiration": "Expire après 1 mois."
						}
					]
				}
			},
			{
				"title": "Cookies de performance et d'analyse",
				"description": "Ces cookies permettent au site Internet de se souvenir des choix que vous avez faits dans le passé.",
				"linkedCategory": "analytics",
				"cookieTable": {
					"headers": {
						"name": "Nom",
						"domain": "Service",
						"description": "Description",
						"expiration": "Expiration"
					},
					"body": [
						{
							"name": "_ga",
							"domain": "Google Analytics",
							"description": "Cookie mis en place par <a href=\"https://analytics.google.com/analytics/web/\" target=\"_blank\">Google Analytics</a>.",
							"expiration": "Expire après 2 ans."
						}
					]
				}
			},
			{
				"title": "Cookies de sécurité",
				"description": "Ces cookies permettent d'authentifier les utilisateurs, d'empêcher l'utilisation frauduleuse des informations de connexion et de protéger les internautes qui interagissent avec le site Internet.",
				"linkedCategory": "security",
				"cookieTable": {
					"headers": {
						"name": "Nom",
						"domain": "Service",
						"description": "Description",
						"expiration": "Expiration"
					},
					"body": [
						{
							"name": "OTZ",
							"domain": "Google reCAPTCHA",
							"description": "Cookie mis en place par <a href=\"https://www.google.com/recaptcha/about/\" target=\"_blank\">Google reCAPTCHA</a>.",
							"expiration": "Expire après 1 mois."
						},
						{
							"name": "__Secure-ENID",
							"domain": "Google reCAPTCHA",
							"description": "Cookie mis en place par <a href=\"https://www.google.com/recaptcha/about/\" target=\"_blank\">Google reCAPTCHA</a>.",
							"expiration": "Expire après 1 an."
						},
						{
							"name": "SOCS",
							"domain": "Google reCAPTCHA",
							"description": "Cookie mis en place par <a href=\"https://www.google.com/recaptcha/about/\" target=\"_blank\">Google reCAPTCHA</a>.",
							"expiration": "Expire après 13 mois."
						},
						{
							"name": "CONSENT",
							"domain": "Google reCAPTCHA",
							"description": "Cookie mis en place par <a href=\"https://www.google.com/recaptcha/about/\" target=\"_blank\">Google reCAPTCHA</a>.",
							"expiration": "Expire après 2 ans."
						},
						{
							"name": "DV",
							"domain": "Google reCAPTCHA",
							"description": "Cookie mis en place par <a href=\"https://www.google.com/recaptcha/about/\" target=\"_blank\">Google reCAPTCHA</a>.",
							"expiration": "Expire après 1 jour."
						},
						{
							"name": "AEC",
							"domain": "Google reCAPTCHA",
							"description": "Cookie mis en place par <a href=\"https://www.google.com/recaptcha/about/\" target=\"_blank\">Google reCAPTCHA</a>.",
							"expiration": "Expire après 6 mois."
						}
					]
				}
			},
			{
				"title": "Plus d'informations",
				"description": "Pour toute question relative à notre politique en matière de cookies et à vos choix, veuillez nous contacter via le support du site."
			}
		]
	}
}